In [1]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ---------------------------------------- 0.0/250.0 kB ? eta -:--:--
     - -------------------------------------- 10.2/250.0 kB ? eta -:--:--
     - -------------------------------------- 10.2/250.0 kB ? eta -:--:--
     ---- -------------------------------- 30.7/250.0 kB 262.6 kB/s eta 0:00:01
     -------------------------------------  245.8/250.0 kB 1.5 MB/s eta 0:00:01
     -------------------------------------- 250.0/250.0 kB 1.4 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
data=pd.read_excel(r"C:\Users\hp\Desktop\sem05\DAV\PRAC\riddhi\prac8.xlsx")
data

    Name  Gender  MonthlyIncome(Rs.)
0   Shah    Male              114000
1   Vats    Male               65000
2   Vats  Female               43150
3  Kumar  Female               69500
4   Vats  Female              155000
5  Kumar    Male              103000
6   Shah    Male               55000
7   Shah  Female              112400
8  Kumar  Female               81030
9   Vats    Male               71900

In [5]:
df=pd.DataFrame(data)
df

    Name  Gender  MonthlyIncome(Rs.)
0   Shah    Male              114000
1   Vats    Male               65000
2   Vats  Female               43150
3  Kumar  Female               69500
4   Vats  Female              155000
5  Kumar    Male              103000
6   Shah    Male               55000
7   Shah  Female              112400
8  Kumar  Female               81030
9   Vats    Male               71900

In [7]:
family_gross_income = df.groupby('Name')['MonthlyIncome(Rs.)'].sum().reset_index()
print(family_gross_income)

    Name  MonthlyIncome(Rs.)
0  Kumar              253530
1   Shah              281400
2   Vats              335050

In [9]:
maxIncomer = df.loc[df.groupby('Name')['MonthlyIncome(Rs.)'].idxmax()]
print(maxIncomer[['Name', 'Gender', 'MonthlyIncome(Rs.)']])

    Name  Gender  MonthlyIncome(Rs.)
5  Kumar    Male              103000
0   Shah    Male              114000
4   Vats  Female              155000

In [10]:
inc = df[df['MonthlyIncome(Rs.)'] > 60000.00]
print(inc)

    Name  Gender  MonthlyIncome(Rs.)
0   Shah    Male              114000
1   Vats    Male               65000
3  Kumar  Female               69500
4   Vats  Female              155000
5  Kumar    Male              103000
7   Shah  Female              112400
8  Kumar  Female               81030
9   Vats    Male               71900

In [14]:
femaleMem = df[(df['Name'] == 'Shah') & (df['Gender'] == 'Female')]

In [20]:
avgInc = femaleMem['MonthlyIncome(Rs.)'].mean()
print(avgInc)

112400.0